Repository: Pixeval/Pixeval
Catalog: src/Pixeval/Strings/*/SettingsPage.resw
Source language: en_us
Languages: fr_fr, ru_ru, zh_cn

# OpenLocalEntry.Header
source: Open local folder
fr_fr: Ouvrir le répertoire local
ru_ru: Открыть локальную папку
zh_cn: 打开本地文件夹

# OpenLocalEntry.Description
source: Files under this folder are important and not meant to be modified
fr_fr: Ce répertoire contient les fichiers importants de configuration, merci de ne pas les modifier
ru_ru: Здесь хранятся важные конфигурационные файлы, пожалуйста, не изменяйте файлы в этой папке
zh_cn: 此处存储了重要的配置文件，请不要修改此处的文件

# ResetDefaultSettingsButton.Content
source: Reset settings
fr_fr: Remettre à zéro les configurations
ru_ru: Сбросить настройки
zh_cn: 重置设置

# ResetDefaultSettingsEntry.Description
source: By clicking on this button you will reset all settings, this operation is irreversible
fr_fr: Cliquer ce bouton pour une remise à zéro de toutes les configurations, cette opération est irréversible
ru_ru: Нажатие этой кнопки сбросит все настройки к значению по умолчанию. Это действие необратимо
zh_cn: 点击该按钮将会将所有设置重置会默认状态，该操作不可撤销

# ResetDefaultSettingsEntry.Header
source: Reset default setting
fr_fr: Remettre à zéro des configurations
ru_ru: Сброс настроек по умолчанию
zh_cn: 重置默认设置

# ResetSettingConfirmationDialogContent
source: This operation is irreversible
fr_fr: Cette opération est irréversible
ru_ru: Это действие необратимо
zh_cn: 该操作将会无法撤销

# ResetSettingConfirmationDialogTitle
source: Are you sure you want to reset all settings?
fr_fr: Etes-vous sûr de remettre à zéro toutes les configurations?
ru_ru: Вы уверены, что хотите сбросить все настройки?
zh_cn: 你确定要重置所有设置项吗？

# ReverseSearchApiKeyEntry.Header
source: SauceNAO API Key
fr_fr: SauceNAO的API Key
ru_ru: API ключ SauceNAO
zh_cn: SauceNAO的API Key

# ReverseSearchApiKeyEntryDescriptionHyperlinkButton.Content
source: You can acquire and API Key at here (requires sign up/login)
fr_fr: Récupérer votre API Key de SauceNAO ici (Authentification/Inscription requise)
ru_ru: Получите API ключ SauceNAO здесь (требуется регистрация/вход)
zh_cn: 在这里获取SauceNAO的API Key（需要注册/登录）

# ReverseSearchApiKeyTextBox.PlaceholderText
source: API Key
fr_fr: Entrez une API Key
ru_ru: Введите API ключ
zh_cn: 请输入API Key

# ReverseSearchResultSimilarityThresholdEntry.Description
source: Threshold of the likelihood of the reverse search, higher value indicates higher similarities, results lower than this value will be ignored
fr_fr: Seuil de confiance de la recherche inversée, les résultats avec une plus faible confiance seront ignorés. Cette indication décide à quel niveau un résultat ressemble à votre image originale
ru_ru: Порог сходства результатов обратного поиска. Результаты ниже этого порога будут игнорироваться. Чем выше значение, тем больше сходство между результатами и исходным изображением
zh_cn: 逆向搜索结果的阈值，如果搜索结果低于该阈值则会被忽略，值越高则说明搜索结果和原图越相似

# ReverseSearchResultSimilarityThresholdEntry.Header
source: Reverse search threshold
fr_fr: Seuil de recherche inversée
ru_ru: Порог сходства обратного поиска
zh_cn: 逆向搜索阈值

# BrowseOriginalImageEntry.Description
source: This option requires more bandwidth and loading time, but you'll get a better experience and faster download speed
fr_fr: Cette option nécessite plus de débit et de temps de chargement, mais vous aurez une meilleure expérience et une meilleure vitesse de téléchargement
ru_ru: Просмотр оригинальных изображений требует больше трафика и времени на загрузку, но обеспечивает лучшее качество и скорость загрузки
zh_cn: 浏览原图需要更多流量和时间加载，但也可以获得更好的浏览体验和更快的下载速度

# BrowseOriginalImageEntry.Header
source: View original images
fr_fr: Visualiser les images en original
ru_ru: Просмотр оригинальных изображений
zh_cn: 浏览时查看原图

# ReconfirmationOfClosingWindowEntry.Description
source: 在关闭窗口前，会弹出对话框要求你再次确认
ru_ru: Включение подтверждения при закрытии окна.

# ReconfirmationOfClosingWindowEntry.Header
source: 关闭窗口再次确认
ru_ru: Подтверждение закрытия окна

# ScrollRateEntry.Description
source: 低于0.1时关闭，开启后可自定义滚动速率，但可能造成不好的体验
ru_ru: Отключается при значении ниже 0.1. Включив, вы сможете настроить скорость прокрутки, но это может привести к ухудшению пользовательского опыта.

# ScrollRateEntry.Header
source: 滚动速率
ru_ru: Скорость прокрутки

# SearchSettingsGroup.Text
source: Search
fr_fr: Configurations de la recherche
ru_ru: Настройки поиска
zh_cn: 搜索设置

# SessionSettingsGroup.Text
source: Session
fr_fr: Configurations de session
ru_ru: Настройки сессии
zh_cn: 会话设置

# SignOutEntry.Description
source: Sign out and exit app
fr_fr: Me déconnecter et quitter l'application
ru_ru: Выйти и закрыть приложение
zh_cn: 退出登录并关闭应用程序

# SignOutEntry.Header
source: Sign out
fr_fr: Déconnecter
ru_ru: Выход из системы
zh_cn: 退出登录

# TargetAPIPlatformEntry.Description
source: Which API platform will be used during request? Keep default if you don't understand
fr_fr: Spécifiez quelle plateforme d'API utilisée pour envoyer les requêtes. Si vous n'en connaissez pas, veuillez à la laisser vide
ru_ru: Указать, какой API платформы использовать для запросов. Если не уверены, оставьте значение по умолчанию
zh_cn: 指定发送请求时使用哪个平台对应的 API，如果不知道这是什么意思请保持默认

# TargetAPIPlatformEntry.Header
source: Target API platform
fr_fr: Plateforme API utilisée
ru_ru: Целевая API платформа
zh_cn: 使用的 API 平台

# ProxyTypeEntry.Description
source: When domain fronting is disabled, this proxy will be used by Pixeval
fr_fr: Lors que le domain fronting est désactivé, ce proxy sera utilisé par Pixeval
ru_ru: Pixeval будет использовать указанный здесь прокси, если не используется доменное фронтирование
zh_cn: 当不使用域前置时，Pixeval 会使用此处指定的代理

# ProxyTypeEntry.Header
source: Proxy type
fr_fr: Type de proxy
ru_ru: Тип прокси
zh_cn: 代理类型

# ProxyTextBoxEntry.Description
source: Protocols will be ignored
fr_fr: Les préfixes de protocole seront ignorés
ru_ru: Протоколы будут игнорироваться
zh_cn: 协议前缀将被忽略

# ProxyTextBoxEntry.Header
source: Proxy server
fr_fr: Serveur de proxy
ru_ru: Прокси-сервер
zh_cn: 代理服务器

# ProxyTextBoxErrorUri
source: The URI of the proxy server is incorrect, please correct it
fr_fr: L'URI du serveur proxy est incorrect, veuillez la corriger
ru_ru: Неверный адрес прокси-сервера, пожалуйста, введите снова
zh_cn: 代理服务器地址输入有误，请重新输入

# ThemeEntry.Header
source: Application theme
fr_fr: Thème d'application
ru_ru: Тема приложения
zh_cn: 应用程序主题

# ThemeEntryDescriptionHyperlinkButton.Content
source: Open system theme settings
fr_fr: Ouvrir les paramètres du thème Windows
ru_ru: Открыть настройки темы Windows
zh_cn: 打开 Windows 系统主题设置

# ThumbnailDirectionEntry.Description
source: The direction of the thumbnail
fr_fr: Orientation de page lors de visualisation des illustrations
ru_ru: Направление страницы при просмотре изображений
zh_cn: 浏览图片时使用的页面方向

# ThumbnailDirectionEntry.Header
source: Thumbnail direction
fr_fr: Orientation des vignettes
ru_ru: Направление миниатюр
zh_cn: 缩略图方向

# TitleTextBlock.Text
source: Pixeval Settings
fr_fr: Configurations de Pixeval
ru_ru: Настройки Pixeval
zh_cn: Pixeval 设置

# UseFileCacheEntry.Description
source: By enabling this setting, the app reduces network requests and improves user experiences, however, more CPU resources is required and frequent disk I/O is expected
fr_fr: Cette option permettra de réduire la consommation du réseau et augmenter votre expérience, mais les calculs CPU et les opérations I/O augmenteront
ru_ru: Включение этого параметра снизит потребление сетевого трафика и улучшит просмотр, но увеличит нагрузку на ЦП и диск
zh_cn: 开启此选项后会减少网络流量消耗并提升浏览体验，但是会增加 CPU 占用以及硬盘读写

# UseFileCacheEntry.Header
source: Use file cache
fr_fr: Utiliser les caches de fichier
ru_ru: Использовать файловый кэш
zh_cn: 使用文件缓存

# VersionSettingsGroup.Text
source: Version
ru_ru: Версия
zh_cn: 版本

# ViewPixevalWebsiteHyperlinkButton.Content
source: Pixeval website
fr_fr: Page d'introduction
ru_ru: Веб-сайт
zh_cn: 介绍网页

# WorkDownloadFormatEntry.Description
source: Set the format of the downloaded works
fr_fr: Format d'art à télécharger
ru_ru: Укажите формат для загрузки произведений
zh_cn: 指定下载作品的格式

# WorkDownloadFormatEntry.Header
source: Work format
fr_fr: Format de téléchargement
ru_ru: Формат загрузки произведений
zh_cn: 下载作品的格式

# NovelFontFamilyComboBox.PlaceholderText
source: Select a font
fr_fr: Choisir une police
ru_ru: Выберите шрифт
zh_cn: 选择字体

# NovelFontWeightComboBox.PlaceholderText
source: Select font weight
fr_fr: Choisir le poid de police
ru_ru: Выберите толщину шрифта
zh_cn: 选择字体粗细

# NovelSettingsFontFamilyEntry.Header
source: Font family
fr_fr: Typographie
ru_ru: Шрифт
zh_cn: 字体

# NovelSettingsFontColorEntry.Header
source: Font color
fr_fr: Couleur de texte
ru_ru: Цвет шрифта
zh_cn: 字体颜色

# NovelSettingsFontColorEntry.Description
source: Body font color
fr_fr: Couleur de texte
ru_ru: Цвет основного текста
zh_cn: 正文字体颜色

# NovelSettingsBackgroundEntry.Header
source: Background color
fr_fr: Couleur de fond
ru_ru: Цвет фона
zh_cn: 背景色

# NovelSettingsBackgroundEntry.Description
source: Page background color
fr_fr: Couleur de fond de page
ru_ru: Цвет фона страницы
zh_cn: 页面背景色

# NovelSettingsFontWeightEntry.Header
source: Font weight
fr_fr: Poid de police
ru_ru: Толщина шрифта
zh_cn: 字体粗细

# NovelSettingsFontWeightEntry.Description
source: Body font weight
fr_fr: Poid de police de texte
ru_ru: Толщина основного текста
zh_cn: 正文字体粗细

# NovelSettingsFontSizeEntry.Header
source: Font size
fr_fr: Taille des caractères
ru_ru: Размер шрифта
zh_cn: 字号

# NovelSettingsFontSizeEntry.Description
source: Body font size
fr_fr: Taille des caractères de texte
ru_ru: Размер основного текста
zh_cn: 正文字号

# NovelSettingsLineHeightEntry.Header
source: Line height
fr_fr: Hauteur de ligne
ru_ru: Высота строки
zh_cn: 行高

# NovelSettingsLineHeightEntry.Description
source: Body line spacing
fr_fr: Hauteur de ligne de texte
ru_ru: Межстрочный интервал основного текста
zh_cn: 正文行距

# NovelSettingsMaxWidthEntry.Header
source: Page width
fr_fr: Largeur de page
ru_ru: Максимальная ширина страницы
zh_cn: 页面宽度

# NovelSettingsMaxWidthEntry.Description
source: Maximum page width
fr_fr: Largeur maximale de page
ru_ru: Максимальная ширина страницы
zh_cn: 页面的最大宽度

# MacroCopiedToClipboard
source: Macros copied to the clipboard
fr_fr: Le macro a été copié sur le clipboard
ru_ru: Макрос скопирован в буфер обмена
zh_cn: 已复制宏到剪切板

# ExtMacroTooltip
source: File extension, like .jpg, .png, etc. Note that the macro already includes the dot '.' in front of the extension. This macro MUST be used on the file name
fr_fr: Extensions des fichiers, e.g. .jpg, .png, etc. A noter que ce macro contient déjà les points devant les suffixes ".", ce macro doit uniquement être utilisé dans les noms de fichier
ru_ru: Расширение файла, например, .jpg, .png и т.д. Обратите внимание, что этот макрос включает точку "." перед расширением и должен быть использован в имени файла
zh_cn: 文件后缀名，类似 .jpg, .png 等，注意该宏已经包含了后缀名前面的点号"."；必须在文件名上使用

# IdMacroTooltip
source: Work ID
fr_fr: ID d'art
ru_ru: ID произведения
zh_cn: 作品ID

# TitleMacroTooltip
source: Work title
fr_fr: Titre d'art
ru_ru: Название произведения
zh_cn: 作品标题

# ArtistIdMacroTooltip
source: Author ID
fr_fr: ID d'auteur
ru_ru: ID автора
zh_cn: 作者ID

# ArtistNameMacroTooltip
source: Author name
fr_fr: Nom d'auteur
ru_ru: Имя автора
zh_cn: 作者名

# PublishYearMacroTooltip
source: Year of publication
fr_fr: L'année de publication
ru_ru: Год публикации произведения
zh_cn: 作品发布年份

# PublishMonthMacroTooltip
source: Month of publication
fr_fr: Le mois de publication
ru_ru: Месяц публикации произведения
zh_cn: 作品发布月份

# PublishDayMacroTooltip
source: Day of publication
fr_fr: Le jour de publication
ru_ru: День публикации произведения
zh_cn: 作品发布日期

# IfPicSetMacroTooltip
source: 如果是多图，该宏会被替换为其参数
ru_ru: Если это несколько изображений, этот макрос будет заменён его параметром

# IfPicAllMacroTooltip
source: 如果是图片（包括静态单图、多图、动图），该宏会被替换为其参数
ru_ru: Если это изображение (включая статичное одиночное изображение, несколько изображений, анимированное изображение), этот макрос будет заменён его параметром

# IfR18MacroTooltip
source: This marco will be replaced by its argument in the case of restricted work (R18 or R18G)
fr_fr: Ce marco sera remplacé par son argument s'il s'agit d'un art restreint (R18 ou R18G)
ru_ru: Если это произведение с рейтингом R18, макрос будет заменён на его параметры
zh_cn: 如果是限制级的（包括R18及R18G），该宏会被替换为其参数

# IfR18GMacroTooltip
source: This marco will be replaced by its argument if it is a R18G work
fr_fr: Ce marco sera remplacé par son argument s'il s'agit d'un art R18G
ru_ru: Если это произведение с рейтингом R18G, макрос будет заменён на его параметры
zh_cn: 如果是R18G的，该宏会被替换为其参数

# IfAiMacroTooltip
source: This marco will be replaced by its argument in the case of AI-generated work
fr_fr: Ce marco sera remplacé par son argument s'il s'agit d'un art généré par l'IA
ru_ru: Если это произведение сгенерировано AI, макрос будет заменён на его параметры
zh_cn: 如果是AI生成的，该宏会被替换为其参数

# IfPicOneMacroTooltip
source: 如果是静态单图，该宏会被替换为其参数
ru_ru: Если это статическое одиночное изображение, макрос будет заменён его параметром

# IfNovelMacroTooltip
source: This marco will be replaced by its argument if it's a novel
fr_fr: Ce marco sera remplacé par son argument s'il s'agit d'un roman
ru_ru: Если это новелла, макрос будет заменён на его параметры
zh_cn: 如果是小说，该宏会被替换为其参数

# IfPicGifMacroTooltip
source: 如果是动图，该宏会被替换为其参数
ru_ru: Если это GIF, макрос будет заменён его параметром

# PicSetIndexMacroTooltip
source: This marco will be replaced by the index of the current image in the manga. This macro MUST be used with the @{if_pic_set=} macro, and MUST be used on the file name
fr_fr: Ce macro sera remplacé par l'indice de l'illustration courante dans la collection (n-ième illust.). Il faut l'utiliser avec le macro '@{if_pic_set=} et sur les noms de fichier
ru_ru: Если это манга, этот макрос будет заменён на индекс текущего изображения в серии; должен использоваться с макросом @{if_pic_set=}, и должен быть в имени файла
zh_cn: 如果是多图，该宏会被替换为当前图片在多图中的索引（第几张）；必须与 @{if_pic_one=} 宏配合使用，必须在文件名上使用

# UseSearchEndDateEntry.Header
source: 启用搜索结束日期
ru_ru: Поиск по дате до:

# UseSearchStartDateEntry.Header
source: 启用搜索开始日期
ru_ru: Поиск по дате от:

# UseSearchStartDateEntry.Description
source: 启用后搜索作品的投稿日期将从此日期开始
ru_ru: После включения дата публикации работ в поиске будет начинаться с этой даты

# UseSearchEndDateEntry.Description
source: 启用后搜索作品的投稿日期将到此日期结束
ru_ru: После включения дата публикации работ в поиске будет заканчиваться этой датой

# OpenExtensionsEntry.Header
source: 打开扩展文件夹
ru_ru: Открыть папку расширений

# OpenExtensionsEntry.Description
source: 此处存储了软件会加载的扩展DLL文件
ru_ru: Здесь хранятся файлы DLL расширений, которые будет загружать программа

# BackupSettingsEntry.Header
source: 备份设置
ru_ru: Резервное копирование настроек

# BackupSettingsEntry.Description
source: 选择导出或导入设置（导出后请注意防止敏感信息泄漏）
ru_ru: Выберите экспорт или импорт настроек (поместите копию в защищенное, от посторонних лиц или программ, место).

# OpenSettingsEntry.Header
source: 打开设置文件夹
ru_ru: Открыть папку с настройками

# OpenSettingsEntry.Description
source: 此处存储了软件的设置文件（包含账号信息）
ru_ru: Здесь хранятся файлы настроек программы (включая данные учетной записи Pixiv).

# ExportSettingsSuccess
source: 导出设置成功
ru_ru: Настройки успешно экспортированы

# ImportSessionSuccess
source: 导入会话成功
ru_ru: Сессия успешно импортирована

# ImportSettingsSuccess
source: 导入设置成功
ru_ru: Настройки успешно импортированы

# ExportSettingsPlaintextEntry.Header
source: 导出明文设置
ru_ru: Экспорт настроек (из текстового файла)

# ExportSettingsPlaintextEntry.Description
source: 以JSON格式导出设置
ru_ru: Экспортировать настройки в формате JSON

# ImportSettingsPlaintextEntry.Description
source: 导入JSON格式的明文设置
ru_ru: Импортировать настройки из файла JSON

# ImportSettingsPlaintextEntry.Header
source: 导入明文设置
ru_ru: Импорт настроек (из текстового файла)
